# ViewerBoundFarClipping Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewerBoundFarClipping Property
ParameterTypeId Class See Also
---
"Far Clipping"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewerBoundFarClipping { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewerBoundFarClipping As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewerBoundFarClipping {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace